#1. Сложение чисел: Посчитайте и выведите сумму чисел 7 и 15.
a = 7
b = 15
res = a + b
print("Result№1 = " + str(res))

#2. Арифметические операции: Вычислите разность чисел 25 и 10 и выведите результат.
a_1 = 25
b_1 = 10
res_1 = a_1 - b_1
print("Result№2 = " + str(res_1))

#3. Умножение: Найдите произведение чисел 6 и 8 и выведите результат.
a_2 = 6
b_2 = 8
res_2 = a_2 * b_2
print("Result№3 = " + str(res_2))

#4. Деление: Поделите число 20 на 4 и выведите результат.
a_3 = 20
b_3 = 4
res_3 = a_3/b_3
print("Result№4 = " + str(res_3))

#5. Комбинация операций: Вычислите результат выражения (10 + 5) * 2 и выведите его.
a_4 = 10
b_4 = 5
c_4 = a_4 + b_4
d_4 = 2
res_4 = c_4 * d_4
print("Result№5 = " + str(res_4))

# 6. Остаток от деления: Найдите остаток от деления числа 17 на 3 и выведите результат.
a_5 = 17
b_5 = 3
res_5 = a_5 % b_5
print("Result№6 = " + str(res_5))

# 7. Выражение с несколькими операциями: Вычислите значение выражения (15 - 3) *(2 + 4) / 6 и выведите результат.
a_6 = 15
b_6 = 3
c_6 = a_6 - b_6
e_6 = 2
f_6 = 4
d_6 = e_6 + f_6
g_6 = 6
res_6 = c_6 * d_6 / g_6
print("Result№7 = " + str(res_6))

# 8. Работа с дробями: Поделите число 22 на 7 и выведите результат как десятичное число.(?)
a_7 = 22.
b_7 = 7.
res_7 = round(a_7/b_7, 2)
print("Result№8 = " + str(res_7))

# 9. Сложное выражение: Вычислите результат выражения (10 + 20) / 5 + 3 * (8 -2) и выведите результат.
a_8 = 10
b_8 = 20
c_8 = a_8 + b_8
e_8 = 8
f_8 = 2
d_8 = e_8 - f_8
temp = 5
temp_0 = 3
res_8 = c_8 / temp + temp_0 * d_8
print("Result№9 = " + str(res_8))

# 10. Операции со скобками: Посчитайте значение выражения 100 - (30 / (2 +3)) * 4 + 10 и выведите его.
a_9 = 2
b_9 = 3
c_9 = a_9 + b_9
e_9 = 30
f_9 = 4
d_9 = e_9 / c_9 * f_9
temp_1 = 100
temp_2 = 10
res_9 = temp_1 - d_9 + temp_2
print("Result№10 = " + str(res_9))